load-tests/socket-artillery.yml
# Socket.IO connection load test — simulates concurrent realtime "active users".
#
# For THIS app, an active user holds one persistent Socket.IO connection while
# the app is open (order updates, notifications). This test measures how many
# simultaneous socket connections one API instance can hold and keep alive.
#
# Prereqs:
#   npm install -g artillery
#   # generate signed tokens first (see gen-tokens.js):
#   cd apps/api && node ../../load-tests/gen-tokens.js 1000 > ../../load-tests/tokens.csv
#
# Run:
#   artillery run -e prod load-tests/socket-artillery.yml
#   # or override target:
#   artillery run --target https://api.serveloco.app load-tests/socket-artillery.yml
#
# NOTE: the target is the SOCKET origin (no /api path). Point at staging unless
# you mean to load production.

config:
  target: "http://localhost:3000"
  environments:
    prod:
      target: "https://api.serveloco.app"
  phases:
    # Open new connections steadily. Each virtual user opens a socket, stays
    # connected for ~60s (like a user with the app open), then disconnects.
    - duration: 60
      arrivalRate: 10      # 10 new connections/sec
      rampTo: 50           # ramping to 50 new/sec
      name: "Ramp connections"
    - duration: 120
      arrivalRate: 50
      name: "Sustained connection churn"
  # Pull a unique token per virtual user from the generated CSV.
  payload:
    path: "tokens.csv"
    fields:
      - "token"
    order: sequence
    skipHeader: true
  socketio:
    # Socket.IO handshake auth — matches extractSocketToken (handshake.auth.token).
    auth:
      token: "{{ token }}"
    transports: ["websocket"]

scenarios:
  - name: "Hold a realtime connection"
    engine: socketio
    flow:
      # Connection happens automatically on scenario start.
      - think: 60          # keep the socket open for 60s (simulated active user)
      - emit:
          channel: "ping"  # harmless; server may ignore unknown events
      - think: 5